In [ ]:
import pandas as pd
from pandas import ExcelWriter
from pandas import ExcelFile

In [ ]:
transactions = pd.read_excel(r"/KPMG_VI_dataset.xlsx", sheet_name='Transactions')
new_customer_lists = pd.read_excel(r"/KPMG_VI_dataset.xlsx", sheet_name='NewCustomerList')
customer_demographic = pd.read_excel(r"/KPMG_VI_dataset.xlsx", sheet_name='CustomerDemographic')
customer_add = pd.read_excel(r"/KPMG_VI_dataset.xlsx", sheet_name='CustomerAddress')

# **Exploring Transactions**

In [ ]:
transactions.head()

   transaction_id  product_id  ...  product_first_sold_date   profit
0               1           2  ...               2012-12-02    17.87
1               2           3  ...               2014-03-03  1702.55
2               3          37  ...               1999-07-20  1544.61
3               4          88  ...               1998-12-16   817.36
4               5          78  ...               2015-08-10  1055.82

[5 rows x 14 columns]

In [ ]:
#Conver the format of "transaction_date" to Date
transactions['transaction_date'] = pd.to_datetime(transactions['transaction_date'], unit='s')
transactions['transaction_date'].head()

0   2017-02-25
1   2017-05-21
2   2017-10-16
3   2017-08-31
4   2017-10-01
Name: transaction_date, dtype: datetime64[ns]

In [ ]:
#Convert format of "product_first_sold_date" to Date
transactions['product_first_sold_date'] = pd.to_datetime(transactions['product_first_sold_date'], unit='s')
transactions['product_first_sold_date'].head()

0   2012-12-02
1   2014-03-03
2   1999-07-20
3   1998-12-16
4   2015-08-10
Name: product_first_sold_date, dtype: datetime64[ns]

In [ ]:
transactions.describe()

       transaction_id   product_id  ...  standard_cost        profit
count    20000.000000  20000.00000  ...   19803.000000  19803.000000
mean     10000.500000     45.36465  ...     556.046951    551.950915
std       5773.647028     30.75359  ...     405.955660    493.412849
min          1.000000      0.00000  ...       7.210000      4.800000
25%       5000.750000     18.00000  ...     215.140000    133.780000
50%      10000.500000     44.00000  ...     507.580000    445.210000
75%      15000.250000     72.00000  ...     795.100000    830.240000
max      20000.000000    100.00000  ...    1759.850000   1702.550000

[8 rows x 7 columns]

**Exploring Blanks and Duplicates**

In [ ]:
#identifying missing values
transactions.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
profit                     197
dtype: int64

In [ ]:
#identifying missing values
duplicates = transactions.duplicated()
transactions[duplicates].sum()

transaction_id             0.0
product_id                 0.0
customer_id                0.0
transaction_date           0.0
online_order               0.0
order_status               0.0
brand                      0.0
product_line               0.0
product_class              0.0
product_size               0.0
list_price                 0.0
standard_cost              0.0
product_first_sold_date    0.0
profit                     0.0
dtype: float64

**Exploring Columns**

In [ ]:
transactions.columns

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost',
       'product_first_sold_date', 'profit'],
      dtype='object')

In [ ]:
transactions['order_status'].value_counts()

Approved     19821
Cancelled      179
Name: order_status, dtype: int64

In [ ]:
transactions['brand'].value_counts()

Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

In [ ]:
transactions['product_line'].value_counts()

Standard    14176
Road         3970
Touring      1234
Mountain      423
Name: product_line, dtype: int64

In [ ]:
transactions['product_class'].value_counts()

medium    13826
high       3013
low        2964
Name: product_class, dtype: int64

In [ ]:
transactions['product_size'].value_counts()

medium    12990
large      3976
small      2837
Name: product_size, dtype: int64

#**Exploring New Customer List**

In [ ]:
new_customer_lists.head()

  first_name  last_name  gender  ...  Unnamed: 20 Rank     Value
0    Chickie    Brister    Male  ...            1    1  1.718750
1      Morly     Genery    Male  ...            1    1  1.718750
2    Ardelis  Forrester  Female  ...            1    1  1.718750
3     Lucine      Stutt  Female  ...            4    4  1.703125
4    Melinda     Hadlee  Female  ...            4    4  1.703125

[5 rows x 23 columns]

In [ ]:
#Drop Unnamed Column
cols = ['Unnamed: 16','Unnamed: 17','Unnamed: 18','Unnamed: 19','Unnamed: 20']
new_customer_lists = new_customer_lists.drop(cols, axis=1)

In [ ]:
#Replace inconsistent values with appropriate values
new_customer_lists['gender'] = customer_demographic['gender'].replace('U','Unspecified')

In [ ]:
#Check for null values
new_customer_lists.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Rank                                     0
Value                                    0
dtype: int64

In [ ]:
new_customer_lists['gender'].value_counts()

Female    513
Male      470
U          17
Name: gender, dtype: int64

In [ ]:
new_customer_lists['wealth_segment'].value_counts()

Mass Customer        508
High Net Worth       251
Affluent Customer    241
Name: wealth_segment, dtype: int64

In [ ]:
new_customer_lists['owns_car'].value_counts()

No     507
Yes    493
Name: owns_car, dtype: int64

In [ ]:
new_customer_lists['state'].value_counts()

NSW    506
VIC    266
QLD    228
Name: state, dtype: int64

In [ ]:
#Checking for duplicate values
duplicates = new_customer_lists.duplicated()
new_customer_lists[duplicates].sum()

first_name                             0.0
last_name                              0.0
gender                                 0.0
past_3_years_bike_related_purchases    0.0
DOB                                    0.0
job_title                              0.0
job_industry_category                  0.0
wealth_segment                         0.0
deceased_indicator                     0.0
owns_car                               0.0
tenure                                 0.0
address                                0.0
postcode                               0.0
state                                  0.0
country                                0.0
property_valuation                     0.0
Rank                                   0.0
Value                                  0.0
dtype: float64

#**Exploring Customer Demographic**

In [ ]:
customer_demographic.head()

   customer_id first_name last_name  ... deceased_indicator  owns_car tenure
0           34   Jephthah  Bachmann  ...                  N        No   20.0
1           66     Anselm     Gawne  ...                  N        No    1.0
2         1888      Sibyl   Scholtz  ...                  N       Yes    1.0
3         3435    Stevena   Allcock  ...                  N        No    1.0
4         2858  Benedicto     Radki  ...                  N       Yes    1.0

[5 rows x 13 columns]

In [ ]:
#Check for null values
id_dups = customer_demographic['customer_id'].isnull().sum()
id_dups

0

In [ ]:
gender = new_customer_lists['gender'].value_counts()

gender

Female    513
Male      470
U          17
Name: gender, dtype: int64

In [ ]:
#Replace inconsistent values with appropriate values
customer_demographic['gender'] = customer_demographic['gender'].replace('U','Unspecified')

In [ ]:
customer_demographic.head()

   customer_id first_name last_name  ... deceased_indicator  owns_car tenure
0           34   Jephthah  Bachmann  ...                  N        No   20.0
1           66     Anselm     Gawne  ...                  N        No    1.0
2         1888      Sibyl   Scholtz  ...                  N       Yes    1.0
3         3435    Stevena   Allcock  ...                  N        No    1.0
4         2858  Benedicto     Radki  ...                  N       Yes    1.0

[5 rows x 13 columns]

#**Merge all customer information into one table**

In [ ]:
#Add ID to new customer list to enable us to merge the tables vertically
#4000 because customer_Demographic has 4000 tuples
new_customer_lists.insert(0, 'customer_id', range(4001, 4001 + len(new_customer_lists)))

In [ ]:
new_customer_lists.head()

   customer_id first_name  last_name  ... property_valuation  Rank     Value
0         4001    Chickie    Brister  ...                  6     1  1.718750
1         4002      Morly     Genery  ...                 11     1  1.718750
2         4003    Ardelis  Forrester  ...                  5     1  1.718750
3         4004     Lucine      Stutt  ...                  1     4  1.703125
4         4005    Melinda     Hadlee  ...                  9     4  1.703125

[5 rows x 19 columns]

In [ ]:
customer_add.head()

   customer_id              address  ...    country property_valuation
0            1   060 Morning Avenue  ...  Australia                 10
1            2  6 Meadow Vale Court  ...  Australia                 10
2            4   0 Holy Cross Court  ...  Australia                  9
3            5  17979 Del Mar Point  ...  Australia                  4
4            6     9 Oakridge Court  ...  Australia                  9

[5 rows x 6 columns]

In [ ]:
# Merge dataframes using the customer_id column
customer_demographic = pd.merge(customer_demographic, customer_add, how='left', on='customer_id')

In [ ]:
customer_demographic.head()

   customer_id first_name last_name  ... state    country property_valuation
0           34   Jephthah  Bachmann  ...   QLD  Australia                8.0
1           66     Anselm     Gawne  ...   NSW  Australia               10.0
2         1888      Sibyl   Scholtz  ...   NSW  Australia               10.0
3         3435    Stevena   Allcock  ...   QLD  Australia                3.0
4         2858  Benedicto     Radki  ...   NSW  Australia               10.0

[5 rows x 18 columns]

In [ ]:
customer_demographic = customer_demographic.drop(['address_x','postcode_x','state_x','country_x','property_valuation_x'], axis=1)

KeyError: ignored

In [ ]:
new_df = pd.concat([customer_demographic, new_customer_lists], ignore_index=True, sort=False)
new_df

      customer_id first_name  last_name  ... property_valuation    Rank  Value
0              34   Jephthah   Bachmann  ...                8.0     NaN    NaN
1              66     Anselm      Gawne  ...               10.0     NaN    NaN
2            1888      Sibyl    Scholtz  ...               10.0     NaN    NaN
3            3435    Stevena    Allcock  ...                3.0     NaN    NaN
4            2858  Benedicto      Radki  ...               10.0     NaN    NaN
...           ...        ...        ...  ...                ...     ...    ...
4995         4996  Ferdinand  Romanetti  ...                7.0   996.0  0.374
4996         4997       Burk    Wortley  ...               10.0   997.0  0.357
4997         4998   Melloney      Temby  ...                2.0   997.0  0.357
4998         4999     Dickie    Cubbini  ...                2.0   997.0  0.357
4999         5000      Sylas    Duffill  ...                9.0  1000.0  0.340

[5000 rows x 20 columns]